Public Attributes | List of all members
API_ClassificationSystem Struct Reference
Classification Manager
Specifies a classification system. More...
#include <APIdefs_Environment.h>
 Public Attributes
 API_Guid  | guid
The Archicad generated unique identifier of the classification system.
 GS::UniString  | name
The display name of the classification system.
 GS::UniString  | description
The general description of the classification system.
 GS::UniString  | source
The source of the classification system (i.e. URL to a classification system standard)
 GS::UniString  | editionVersion
The version string of the classification system.
 GSDateRecord  | editionDate
The release date of this version of the classification system.
Detailed Description
Specifies a classification system.